Tekla Open API Reference for Tekla Structures 2025
EnumConverter.ConvertTo Method
[Missing <summary> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)"]
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override Object ConvertTo(
	ITypeDescriptorContext context,
	CultureInfo culture,
	Object value,
	Type destinationType
)
Public Overrides Function ConvertTo (
	context As ITypeDescriptorContext,
	culture As CultureInfo,
	value As Object,
	destinationType As Type
) As Object
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
[Missing <param name="context"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)"]
culture
Type: System.Globalization.CultureInfo
[Missing <param name="culture"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)"]
value
Type: System.Object
[Missing <param name="value"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)"]
destinationType
Type: System.Type
[Missing <param name="destinationType"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)"]
See Also
Reference
EnumConverter Class
Tekla.Structures.Datatype Namespace